Revit 2026 API

# ExternalResourceLoadContext Class

---

This class contains data describing the context related to an external resource load operation.

SystemObject Autodesk.Revit.DBExternalResourceLoadContext

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalResourceLoadContext : IDisposable
```
```vb
Public Class ExternalResourceLoadContext
	Implements IDisposable
```
```cpp
public ref class ExternalResourceLoadContext : IDisposable
```
```fsharp
type ExternalResourceLoadContext =
    class
        interface IDisposable
    end
```

The ExternalResourceLoadContext type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LoadOperationType | An enum value indicating whether the resource load was triggered by an automatic event (such as file open) or an explicit user action. |

|  | Name | Description |
| --- | --- | --- |
|  | CallingDocumentHasModelPath | Indicates whether the document requesting the external resource has a defined ModelPath. |
|  | Dispose | Releases all resources used by the ExternalResourceLoadContext |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCallingDocumentModelPath | Returns a copy of the ModelPath of the document that is requesting the external resource. |
|  | GetCurrentlyLoadedReference | Returns a copy of the ExternalResourceReference currently in use by the containing element. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Note that automatic loads can occur in the context of other operations such as opening a file. During automatic loads, it is therefore recommended that the server only display UI that is critical for the user to see (such as error message).

The loading operation type is Explicit when the user is specifically trying to reload the resource. During explicit loads, it may be desirable to provide more feedback to the user, such as specific feedback that the load operation succeeded.

#### Reference

Autodesk.Revit.DB Namespace